In [1]:

import pandas as pd
import sqlite3 as s

In [2]:
conn = s.connect('sqlite4.db')

In [3]:
cn = conn.cursor()

In [4]:
cn.execute("CREATE TABLE employees (emp_id INTEGER PRIMARY KEY, first_name VARCHAR(50), last_name VARCHAR(50))")

In [5]:
cn.execute("INSERT INTO employees VALUES (1,'Ram','khan')")
cn.execute("INSERT INTO employees VALUES (2,'Shyam','murti')")
cn.execute("INSERT INTO employees VALUES (3,'Dev','kumar')")

In [6]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(1, 'Ram', 'khan'), (2, 'Shyam', 'murti'), (3, 'Dev', 'kumar')]

In [7]:
new_employees = [(4, 'Kirti', 'prasad'),
 (5, 'Sonu', 'reman'),
 (6, 'Kavita', 'Barman'),
 (7, 'Raju', 'Adani'),
 (8, 'John', 'Smith'),
 (9, 'Angela', 'Marker'),
 (10, 'Mohan', 'joshi')]
conn.executemany('INSERT INTO employees VALUES (?, ?, ?)', new_employees)

In [8]:
cn.execute("SELECT * FROM employees;")
print(cn.fetchall())

[(1, 'Ram', 'khan'), (2, 'Shyam', 'murti'), (3, 'Dev', 'kumar'), (4, 'Kirti', 'prasad'), (5, 'Sonu', 'reman'), (6, 'Kavita', 'Barman'), (7, 'Raju', 'Adani'), (8, 'John', 'Smith'), (9, 'Angela', 'Marker'), (10, 'Mohan', 'joshi')]

In [9]:
cn.execute("SELECT * FROM employees;")

results = cn.fetchall()
for i in results:
    print(i)


cn.close()

(1, 'Ram', 'khan')
(2, 'Shyam', 'murti')
(3, 'Dev', 'kumar')
(4, 'Kirti', 'prasad')
(5, 'Sonu', 'reman')
(6, 'Kavita', 'Barman')
(7, 'Raju', 'Adani')
(8, 'John', 'Smith')
(9, 'Angela', 'Marker')
(10, 'Mohan', 'joshi')

In [10]:
conn.commit()  # for not loss data or miss

In [11]:
cn.close()
conn.close()

In [12]:
con = s.connect('sqlite4.db')
df_employees = pd.read_sql_query('select * from employees', con)

In [13]:
df_employees

   emp_id first_name last_name
0       1        Ram      khan
1       2      Shyam     murti
2       3        Dev     kumar
3       4      Kirti    prasad
4       5       Sonu     reman
5       6     Kavita    Barman
6       7       Raju     Adani
7       8       John     Smith
8       9     Angela    Marker
9      10      Mohan     joshi

In [14]:
update_query = "UPDATE employees SET emp_id = ? WHERE first_name = ?"
values = (77, 'John')
con.execute(update_query, values)
con.commit()


df_updated = pd.read_sql_query('SELECT * FROM employees', con)


con.close()


print(df_updated)

   emp_id first_name last_name
0       1        Ram      khan
1       2      Shyam     murti
2       3        Dev     kumar
3       4      Kirti    prasad
4       5       Sonu     reman
5       6     Kavita    Barman
6       7       Raju     Adani
7       9     Angela    Marker
8      10      Mohan     joshi
9      77       John     Smith

In [15]:

con = s.connect('sqlite4.db')
delete_query = "DELETE FROM employees WHERE emp_id = ?"
values = (3,)
con.execute(delete_query, values)
con.commit()
con.close()

con = s.connect('sqlite4.db')

df_updated = pd.read_sql_query('SELECT * FROM employees', con)

con.close()
print(df_updated)

   emp_id first_name last_name
0       1        Ram      khan
1       2      Shyam     murti
2       4      Kirti    prasad
3       5       Sonu     reman
4       6     Kavita    Barman
5       7       Raju     Adani
6       9     Angela    Marker
7      10      Mohan     joshi
8      77       John     Smith

In [16]:
# ALTER does add, remove ,modify structure of table
# Connect to the SQLite database
con = s.connect('sqlite4.db')

alter_query = "ALTER TABLE employees ADD COLUMN salary REAL"
con.execute(alter_query)
con.commit()

con = s.connect('sqlite4.db')
df_updated = pd.read_sql_query('SELECT * FROM employees', con)

con.close()
print(df_updated)

   emp_id first_name last_name salary
0       1        Ram      khan   None
1       2      Shyam     murti   None
2       4      Kirti    prasad   None
3       5       Sonu     reman   None
4       6     Kavita    Barman   None
5       7       Raju     Adani   None
6       9     Angela    Marker   None
7      10      Mohan     joshi   None
8      77       John     Smith   None

In [17]:
con = s.connect('sqlite4.db')  # Connect to the database

drop_query = "DROP TABLE if exists employees"
con.execute(drop_query)
con.commit()

try:
    df_updated = pd.read_sql_query('SELECT * FROM employees', con)
    print("Table 'employees' exists")
    print(df_updated)
except:
    print("Table 'employees' does not exist.")
finally:
    con.close()

Table 'employees' does not exist.

In [18]:
df_updated.to_csv('employee_data.csv')